# AIDM7400 Data Analysis and Visualization Studio
# Exercise: Data cleaning

- Student ID :20465106
- Name : Chen Xiaoqi

In [1]:
# Importing libraries
import pandas as pd
import numpy as np

# Read csv file into a pandas dataframe
df = pd.read_csv("property data.csv")

# Take a look at df
df

   ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS
0   104.0      PUTNAM            Y            3
1   197.0   LEXINGTON            N            3
2     NaN   LEXINGTON            N          NaN
3   201.0    BERKELEY           12            1
4   203.0    BERKELEY            Y            3
5   207.0    BERKELEY            Y          NaN
6     NaN  WASHINGTON          NaN            2
7   213.0     TREMONT            Y           --
8   215.0     TREMONT            Y           na

- **Feature description**
    - ST_NUM: Street number
    - ST_NAME: Street name
    - OWN_OCCUPIED: Is the residence owner occupied
    - NUM_BEDROOMS: Number of bedrooms
- **The expected types**
    - ST_NUM: float or int, some sort of numeric type
    - ST_NAME: string
    - OWN_OCCUPIED: string, Y (“Yes”) or N (“No”)
    - NUM_BEDROOMS: float or int, a numeric type
- Check missing values

In [2]:
# Looking at the ST_NUM column
print(df['ST_NUM'])
df['ST_NUM'].isnull()

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [3]:
# Looking at the NUM_BEDROOMS column
print(df['NUM_BEDROOMS'])
df['NUM_BEDROOMS'].isnull()

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7     --
8     na
Name: NUM_BEDROOMS, dtype: object

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

**Task 1.** Convert non-standard missing values into 'NaN'\
**Task 2.** Deal with missing values
1. Replace missing values in ST_NUM column with median
1. Replace missing values in OWN_OCCUPIED column with most frequent value. (Hint: using mode() function)
1. Replace missing values in NUM_BEDROOMS column with mean value (Hint: check data type of NUM_BEDROOMS first, cast a column to a specified data type [here](https://datatofish.com/convert-string-to-float-dataframe/))

**Extra Task.** Deal with unexpected values
1. Detect unexpected values in column OWN_OCCUPIED, replace them with NaN
1. Replace NaN with most frequent value

The codes in this notebook take insipiration from various sources. All codes are for educational purposes only and released under the CC1.0.

# Task1 
- Convert non-standard missing values into 'NaN'

In [4]:
df1 = df.copy()

In [5]:
df1 = df1.replace(['--','na'], np.nan)
df1

   ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS
0   104.0      PUTNAM            Y            3
1   197.0   LEXINGTON            N            3
2     NaN   LEXINGTON            N          NaN
3   201.0    BERKELEY           12            1
4   203.0    BERKELEY            Y            3
5   207.0    BERKELEY            Y          NaN
6     NaN  WASHINGTON          NaN            2
7   213.0     TREMONT            Y          NaN
8   215.0     TREMONT            Y          NaN

## Task 2
1. Replace missing values in ST_NUM column with median
1. Replace missing values in OWN_OCCUPIED column with most frequent value. (Hint: using mode() function)
1. Replace missing values in NUM_BEDROOMS column with mean value (Hint: check data type of NUM_BEDROOMS first, cast a column to a specified data type [here](https://datatofish.com/convert-string-to-float-dataframe/))

In [6]:
#replace using median
median = df1['ST_NUM'].median()
df1['ST_NUM'].fillna(median, inplace = True)

In [7]:
df1

   ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS
0   104.0      PUTNAM            Y            3
1   197.0   LEXINGTON            N            3
2   203.0   LEXINGTON            N          NaN
3   201.0    BERKELEY           12            1
4   203.0    BERKELEY            Y            3
5   207.0    BERKELEY            Y          NaN
6   203.0  WASHINGTON          NaN            2
7   213.0     TREMONT            Y          NaN
8   215.0     TREMONT            Y          NaN

In [8]:
# replace using mode()function
df1['OWN_OCCUPIED'] = df1['OWN_OCCUPIED'].fillna(df1['OWN_OCCUPIED'].mode()[0])
df1

   ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS
0   104.0      PUTNAM            Y            3
1   197.0   LEXINGTON            N            3
2   203.0   LEXINGTON            N          NaN
3   201.0    BERKELEY           12            1
4   203.0    BERKELEY            Y            3
5   207.0    BERKELEY            Y          NaN
6   203.0  WASHINGTON            Y            2
7   213.0     TREMONT            Y          NaN
8   215.0     TREMONT            Y          NaN

In [9]:
#replace using mean
print(df1['NUM_BEDROOMS'])
df1['NUM_BEDROOMS'].isnull()

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7    NaN
8    NaN
Name: NUM_BEDROOMS, dtype: object

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
8     True
Name: NUM_BEDROOMS, dtype: bool

In [10]:
df1['NUM_BEDROOMS'] = df1['NUM_BEDROOMS'].astype(float)
print(df['NUM_BEDROOMS'])

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7     --
8     na
Name: NUM_BEDROOMS, dtype: object

In [11]:
df1['NUM_BEDROOMS'] = df1['NUM_BEDROOMS'].fillna(df1['NUM_BEDROOMS'].mean())
df1

   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS
0   104.0      PUTNAM            Y           3.0
1   197.0   LEXINGTON            N           3.0
2   203.0   LEXINGTON            N           2.4
3   201.0    BERKELEY           12           1.0
4   203.0    BERKELEY            Y           3.0
5   207.0    BERKELEY            Y           2.4
6   203.0  WASHINGTON            Y           2.0
7   213.0     TREMONT            Y           2.4
8   215.0     TREMONT            Y           2.4

**Extra Task.** Deal with unexpected values
1. Detect unexpected values in column OWN_OCCUPIED, replace them with NaN
1. Replace NaN with most frequent value

In [12]:
#extra task 1-

In [17]:
print(df1['OWN_OCCUPIED'])
df1['OWN_OCCUPIED'].isnull()

0     Y
1     N
2     N
3    12
4     Y
5     Y
6     Y
7     Y
8     Y
Name: OWN_OCCUPIED, dtype: object

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

- I found that 12 is an unexpected value

In [18]:
#pandas cannot detect this unexpected value
df1.isnull().sum()

ST_NUM          0
ST_NAME         0
OWN_OCCUPIED    0
NUM_BEDROOMS    0
dtype: int64

In [29]:
for i in df1['OWN_OCCUPIED']:
    if i != 'N' and i !='Y':
        print(i)

12

- detect unexpexted value is 12

In [31]:
df1 = df1.replace(['12'], np.nan)
df1

   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS
0   104.0      PUTNAM            Y           3.0
1   197.0   LEXINGTON            N           3.0
2   203.0   LEXINGTON            N           2.4
3   201.0    BERKELEY          NaN           1.0
4   203.0    BERKELEY            Y           3.0
5   207.0    BERKELEY            Y           2.4
6   203.0  WASHINGTON            Y           2.0
7   213.0     TREMONT            Y           2.4
8   215.0     TREMONT            Y           2.4

In [33]:
# extra task 2-
df1['OWN_OCCUPIED'] = df1['OWN_OCCUPIED'].fillna(df1['OWN_OCCUPIED'].mode()[0])
df1

   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS
0   104.0      PUTNAM            Y           3.0
1   197.0   LEXINGTON            N           3.0
2   203.0   LEXINGTON            N           2.4
3   201.0    BERKELEY            Y           1.0
4   203.0    BERKELEY            Y           3.0
5   207.0    BERKELEY            Y           2.4
6   203.0  WASHINGTON            Y           2.0
7   213.0     TREMONT            Y           2.4
8   215.0     TREMONT            Y           2.4